MONGO_URL = 'localhost'
MONGO_DB = '百度地图API————兴趣点'
MONGO_TABLE = '开福区'

ADDRESS = '湖南大学'
FILENAME = '兴趣点.csv'
S1 = '112.915388,28.200807,113.091466,28.395483' #  开福区范围，BD
SCOPE = S1     # scope是对角的经纬度坐标，ex：'31.61,118.46,32.29,119.24'

DIVD = 0.03     # scope的精度，0.03相当于
BAIDU_KEY = 'EkvyhcT1qMnz8ALjmWGR1gjIl4MMm9pr'   # 百度ak
# GAODE_KEY = 'ef1485936acb22e6e9d2e27eefef2dd3'   # 高德ak
POIS = ['麻辣烫','沙县小吃']
POIS_ALL = {'商业': ['酒店', '购物', '金融'],
            '公共服务': ['生活服务', '丽人', '运动健身', '生活服务', '留学中介机构', '培训机构', '汽车销售', '汽车维修',
                     '汽车美容', '汽车配件', '汽车租赁', '汽车检测场'],
            '行政机构': ['政府机构'],
            '停车场': ['停车场'],
            '旅游景点': ['旅游景点'],
            '工业': ['公司企业'],
            '餐饮': ['美食'],
            '娱乐': ['休闲娱乐'],
            '教育': ['高等院校', '中学', '小学', '幼儿园', '成人教育', '亲子教育', '特殊教育学校'],
            '医疗': ['医疗'],
            '文化设施': ['图书馆', '科技馆', '新闻出版', '广播电视', '艺术团体', '美术馆', '展览馆', '文化宫'],
            '商务办公': ['科研机构', '写字楼'],
            '交通服务设施': ['飞机场', '火车站', '地铁站', '长途汽车站', '公交车站', '港口', '加油加气站', '服务区', '收费站', '桥', '充电站', '路侧停车位']}